docs/implementation.org
#+AUTHOR: Raghav Mittal
#+DATE: 24 September, 2017
#+TITLE: Implementation
We will implement a small prototype which will be a JavaScript API using which
a developer can embed different tools in the frontend code to generate desired
UX for user with disabilities.
* Requirements
** For Voice I/O (for type C users, type F users)
    - API for text to speech synthsis
    - API for voice recognition
** For type D users
    - Multicolor options on CSS files
** All output sounds to visual text display (For type A users)
    - API for speech(capture sounds generated by software) to text conversion.
** For performing user Accessibility test
    - create a small demo like test for starting a an app in accessibility
      mode, which will ask user to give voice input or
      choose an option. This will ensure the type of user.
* Technical specs
** Prototype development sprints classified according to I/O type
  | I/O type     | milestone        |
  |--------------+------------------|
  | Voice output | page reader      |
  |              | page area reader |
  | Voice input  | textarea writer  |
  |              | form filler      |
  | Voice I/O    | form filler      |
  |              | page navigation  |
  |              |                  |
** Available resources
- API for text to speech - [[https://developers.google.com/web/updates/2014/01/Web-apps-that-talk-Introduction-to-the-Speech-Synthesis-API][google speech synthesis API ]]
- API for speech to text - [[https://www.talater.com/annyang/][annyang]]
** Implementation 
*** Page Reader
**** API
| class name  | functionality                                                                                                                     |
|-------------+-----------------------------------------------------------------------------------------------------------------------------------|
| =speak=     | to identify an element as a voice output                                                                                          |
| =speak-alt= | to identify =alt= attribute of an element as voice output.                                                                        |
| =seq-n=     | to mark the sequence number =n= of an element. It is the order in which it should be narrated among multiple narratable elements. |
|             |                                                                                                                                   |
