docs/implementation.html
<!doctype html>
<html lang="en">
<head>
<title>Implementation</title>
<!-- 2017-09-24 Sun 12:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Raghav Mittal">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Implementation</h1>
<p>
We will implement a small prototype which will be a JavaScript API using which
a developer can embed different tools in the frontend code to generate desired
UX for user with disabilities.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Requirements</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> For Voice I/O (for type C users, type F users)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>API for text to speech synthsis
</li>
<li>API for voice recognition
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> For type D users</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Multicolor options on CSS files
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> All output sounds to visual test display (For type A users)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>API for speech(capture sounds generated by software) to text conversion.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> For performing user Accessibility test</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>create a small demo like test for starting a an app in accessibility
mode, which will ask user to give voice input or
choose an option. This will ensure the type of user.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Technical specs</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Prototype development sprints classified according to I/O type</h3>
<div class="outline-text-3" id="text-2-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">I/O type</th>
<th scope="col" class="text-left">milestone</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Voice output</td>
<td class="text-left">page reader</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">page area reader</td>
</tr>

<tr>
<td class="text-left">Voice input</td>
<td class="text-left">textarea writer</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">form filler</td>
</tr>

<tr>
<td class="text-left">Voice I/O</td>
<td class="text-left">form filler</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">page navigation</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Available resources</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>API for text to speech - <a href="https://developers.google.com/web/updates/2014/01/Web-apps-that-talk-Introduction-to-the-Speech-Synthesis-API">google speech synthesis API </a>
</li>
<li>API for speech to text - <a href="https://www.talater.com/annyang/">annyang</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Implementation</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Page Reader</h4>
<div class="outline-text-4" id="text-2-3-1">
</div><ol class="org-ol"><li><a id="sec-2-3-1-1" name="sec-2-3-1-1"></a>API<br ><div class="outline-text-5" id="text-2-3-1-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">class name</th>
<th scope="col" class="text-left">functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left"><code>speak</code></td>
<td class="text-left">to identify an element as a voice output</td>
</tr>

<tr>
<td class="text-left"><code>speak-alt</code></td>
<td class="text-left">to identify <code>alt</code> attribute of an element as voice output.</td>
</tr>

<tr>
<td class="text-left"><code>seq-n</code></td>
<td class="text-left">to mark the sequence number <code>n</code> of an element. It is the order in which it should be narrated among multiple narratable elements.</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li></ol>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Requirements</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. For Voice I/O (for type C users, type F users)</a></li>
<li><a href="#sec-1-2">1.2. For type D users</a></li>
<li><a href="#sec-1-3">1.3. All output sounds to visual test display (For type A users)</a></li>
<li><a href="#sec-1-4">1.4. For performing user Accessibility test</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Technical specs</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Prototype development sprints classified according to I/O type</a></li>
<li><a href="#sec-2-2">2.2. Available resources</a></li>
<li><a href="#sec-2-3">2.3. Implementation</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Date: 24 September, 2017</p>
<p class="author">Author: Raghav Mittal</p>
<p class="date">Created: 2017-09-24 Sun 12:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org-mode</a> 9.0.8)</p>
</div>
</footer>
</body>
</html>
